Repository: NatalyLazorenko/angular-example
Catalog: src/locale/messages.*.xlf
Languages: de

source: Understanding Angular
de: Angular verstehen

source: Trigger alert message
de: Alarmmeldung auslösen

source: You can set my color in the component!
de: Sie können meine Farbe in der Komponente festlegen!

source: My color is {{ fontColorText }}
de: Meine Farbe ist {{ fontColorText }}

source: blue
de: blau

source: Hello, World
de: Hallo, Welt

source: Hello World: Dependency Injection
de: Hallo Welt: Abhängigkeitsinjektion

source: Log me!
de: Log mich!

source: Be sure to open the console to view the output!
de: Öffnen Sie unbedingt die Konsole, um die Ausgabe anzuzeigen!

source: Hello, World!
de: Hallo, Welt!

source: Hello World: ngIf!
de: Hallo Welt!: ngIf!

source: Make text editable!
de: Machen Sie Text bearbeitbar!

source: You can edit the following paragraph.
de: Sie können den folgenden Absatz bearbeiten.

source: The following paragraph is read only. Try clicking the button!
de: Der folgende Absatz ist schreibgeschützt. Versuchen Sie, auf die Schaltfläche zu klicken!

source: I'm read only!
de: Ich bin schreibgeschützt!

source: You can edit me!
de: Du kannst mich bearbeiten!

source: Hello World Template
de: Hallo Welt Vorlage

source: Make text editable!
de: Machen Sie Text bearbeitbar!

source: I am read only!
de: Ich bin schreibgeschützt!

source: Hello World
de: Hallo Welt

source: This is my first component!
de: Das ist meine erste Komponente!
